export const WEEKS_COUNT = 15;

export const SUBJECTS = [
    { id: "CAI2500301", name: '情報基礎数学２', totalLectures: 15 },
    { id: "CAI2500601", name: '情報システム概論', totalLectures: 15 },
    { id: "CAI2500701", name: 'ゲームシステム概論', totalLectures: 15 },
    { id: "CAI2500901", name: '応用プログラミング', totalLectures: 15 },
    { id: "CAI2502401", name: 'AI概論', totalLectures: 15 },
    { id: "CBD2500501", name: 'コミュニケーション２', totalLectures: 15 },
    { id: "CBD2501001", name: '文化を読みとくB', totalLectures: 15 },
    { id: "CBD2502001", name: '基盤英語２', totalLectures: 15 },
    { id: "CAI2505101", name: 'メディアリテラシ', totalLectures: 8 },
];

export const WEEKLY_NOTES = {
    2: {
        '文化を読みとくB': '【リアルタイム授業】\n１章：１０月４日（土）午前10：00～午前11：30 (10:00～11:30) (UZ)'
    },
    5: {
        '応用プログラミング': '【リアルタイム授業】\n５章１回目：１０月２４日（金）午後3：00～午後4：30 (15:00～16:30) (UZ)\n５章２回目：１０月２５日（土）午前10：00～午前11：30 (10:00～11:30) (UZ)'
    },
    8: {
        '応用プログラミング': '【リアルタイム授業】\n８章：11月14日（金）午後3:00～午後4:30 (15:00～16:30) (UZ)'
    },
    13: {
        '応用プログラミング': '【リアルタイム授業】\n１３章：12月20日（土）午前10：00～午前11：30 (10:00～11:30) (UZ)'
    },
    15: {
        '応用プログラミング': '【リアルタイム授業】\n１５章：1月9日（金）午後3:00～午後4:30 (15:00～16:30) (UZ)\n1月10日（土）午前10：00～午前11：30 (10:00～11:30) (UZ)'
    }
};